//1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
/*
{
    let numbers = [10, 15, 34, 45, 23, 43, 67, 87, 32, 90]
    console.log(numbers);
    let results = 10 + 15 + 34 + 45 + 23 + 43 + 67 + 87 + 32 + 90;
    console.log(results);

}*/
//2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
/*{
    let book = {
        name: `Дон Кихот`,
        quantity: 150,
        genre: `роман`
        }
}*/

//3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори

/*{
    let book = {
        name: `Asteris - будущее телефонии`,
        quantity: 300,
        genre: `ОС и Сети`,
        autors: [`Меггелен Джим Ван`, `Мадсен Лейф`, `Смит Джаред`]
    }
}*/

//4. Створити масив об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
/*{
    let book1 = {
        name: `Дон Кихот`,
        quantity: 150,
        genre: `роман`
    }

    let book2 = {
        name: `Asteris - будущее телефонии`,
        quantity: 300, genre: `ОС и Сети`,
        autors: [`Меггелен Джим Ван`, `Мадсен Лейф`, `Смит Джаред`]
    }


    let books = [book1, book2];
    console.log(books[0]);
    console.log(books[1]);
}*/

/*5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
Значення площі зберігати в змінній s.*/
/*
let height = 23;
let width = 10;
let s = height*width;
console.log(s);*/

//6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
//         результат помістіть у змінну v.

/*let heightC = 10;
let dC = 4;
let pi = 3.14;

let v = pi*Math.pow(dC/2, 2)*10;
console.log(v);*/

//7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
//        Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).
/*let n = 3;
let m = 4;
let k = Math.pow(2,2)+Math.pow(3,2);
console.log(k);*/
