//- Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.
/*{
    let a = prompt('Введіть число A');
    let b = prompt(`Введіть число B`);
    if (Number.isInteger(a / 1) && Number.isInteger(b / 1)) {
        if (a > b) {
            console.log(`А більше`);
        }else if(b > a) {
            console.log(`В більше`)
        }else
            console.log(`числа рівні між собой`);
    }else{
        console.log(`Необхідно вводити цілі числа`)
    }
}*/
//
//
//  - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//
/*let apt = prompt(`Введіть номер квартири`)
if (apt >= `1` && apt <= `20`){
    console.log(`В першому під'їзді`);
}
else if (apt >= `21` && apt <= `48`){
    console.log(`В другому під'їзді`);
}
else if (apt >= `49` && apt <= `90`){
    console.log(`В третьому під'їзді`);
}*/
//
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//


/*{
    let number = prompt('??');
    switch (number) {
        case `10`:
            console.log(`ВІРНО`);
            break;
    default:
        console.log(`НЕВІРНО`);
        break;
    }
}*/

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//
/*{
    let x = prompt();// необхідно ввести самостійно, х promзt не передасть нам потрібне
    if (typeof x === `number`) {
        console.log(`1`);
    } else if (typeof x === `string`) {
        console.log(`2`);
    } else if (typeof x === `boolean`) {
        console.log(`3`)
    } else if (typeof x === `object`) {
        console.log(`3`)
    } else {
        console.log()
    }
}*/
//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//
//
/*{
let cels = prompt(`Яка температура повітря сьогодні?`);
if (cels>=+10 && cels<=+22){
    console.log(`ВЧИТИСЯ`);
}else {
    console.log(`ОНЛАЙН`);
}
}*/
//  - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
/*let shans = prompt(`Прийми участь в вікторині, введи число від 1 до 5 і виграй приз!`);
switch (shans){
    case `1`:
        console.log(`ручка`);
        break;
    case `2`:
        console.log(`чашка`);
        break;
    case `3`:
        console.log(`блокнот`);
        break;
    case `4`:
        console.log(`шарф`);
        break;
    case `5`:
        console.log(`рюкзак`);
        break;
    default:
        console.log(`Число введено невірно`);
        break;
}*/
